# yolo11-column.yaml
# ─────────────────────────────────────────────────────────────────────────────
# YOLOv11 architecture with a P2 (stride-4) detection head added.
#
# Why P2?  Columns in floor plans are 16–42 px on a 4096-px canvas.
# At imgsz=1280 they scale to ~5–13 px.  The standard P3 head (stride 8)
# can miss objects smaller than ~16 px.  P2 (stride 4) sees objects as small
# as ~8 px — crucial for this dataset.
#
# Transfer-learning path
# ─────────────────────────────────────────────────────────────────────────────
#  Phase 1  (this file, nc=1)
#    → train from scratch on column data
#    → save best weights as column_detect.pt
#
#  Phase 2  (future: door, wall, stairs  → nc=4)
#    from train.py:
#        model = YOLO("column_detect.pt")   # backbone weights carry over
#        model.train(data="dataset_all.yaml", ...)   # nc=4 in yaml/data
#    YOLO automatically re-initialises the Detect head for nc=4 and
#    fine-tunes the shared backbone — this is standard transfer learning.
#
#  Alternatively (recommended long-term):
#    Generate all class datasets together and train a single nc=4 model
#    from column_detect.pt as the backbone initialiser.  One model,
#    one inference call, shared feature extraction.
# ─────────────────────────────────────────────────────────────────────────────

nc: 1   # classes (overridden at training time by data.yaml; set 4 for Phase 2)

scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00,  512]
  l: [1.00, 1.00,  512]

# ── Backbone (identical to yolo11.yaml) ──────────────────────────────────────
backbone:
  - [-1, 1, Conv,  [64,   3, 2]]           #  0 – P1/2
  - [-1, 1, Conv,  [128,  3, 2]]           #  1 – P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]]     #  2 – P2 feature map  ← used by P2 head
  - [-1, 1, Conv,  [256,  3, 2]]           #  3 – P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]]     #  4 – P3 feature map  ← used by P3 head
  - [-1, 1, Conv,  [512,  3, 2]]           #  5 – P4/16
  - [-1, 2, C3k2,  [512,  True]]           #  6 – P4 feature map  ← used by P4 head
  - [-1, 1, Conv,  [1024, 3, 2]]           #  7 – P5/32
  - [-1, 2, C3k2,  [1024, True]]           #  8
  - [-1, 1, SPPF,  [1024, 5]]             #  9
  - [-1, 2, C2PSA, [1024]]                # 10 – P5 feature map  ← used by P5 head

# ── Head (FPN top-down + PAN bottom-up, P2 added) ────────────────────────────
head:
  # ── Top-down: P5 → P4 → P3 → P2 ──────────────────────────────────────────
  - [-1,       1, nn.Upsample, [None, 2, nearest]]   # 11  upsample P5
  - [[-1, 6],  1, Concat,      [1]]                  # 12  cat P4 backbone
  - [-1,       2, C3k2,        [512, False]]          # 13  P4/16 features

  - [-1,       1, nn.Upsample, [None, 2, nearest]]   # 14  upsample P4
  - [[-1, 4],  1, Concat,      [1]]                  # 15  cat P3 backbone
  - [-1,       2, C3k2,        [256, False]]          # 16  P3/8  features

  - [-1,       1, nn.Upsample, [None, 2, nearest]]   # 17  upsample P3
  - [[-1, 2],  1, Concat,      [1]]                  # 18  cat P2 backbone
  - [-1,       2, C3k2,        [128, False]]          # 19  P2/4  features  ← small objects

  # ── Bottom-up: P2 → P3 → P4 → P5 ─────────────────────────────────────────
  - [-1,        1, Conv,   [128, 3, 2]]               # 20  downsample P2→P3
  - [[-1, 16],  1, Concat, [1]]                       # 21  cat P3 top-down
  - [-1,        2, C3k2,   [256, False]]              # 22  P3/8  output

  - [-1,        1, Conv,   [256, 3, 2]]               # 23  downsample P3→P4
  - [[-1, 13],  1, Concat, [1]]                       # 24  cat P4 top-down
  - [-1,        2, C3k2,   [512, False]]              # 25  P4/16 output

  - [-1,        1, Conv,   [512, 3, 2]]               # 26  downsample P4→P5
  - [[-1, 10],  1, Concat, [1]]                       # 27  cat P5 backbone
  - [-1,        2, C3k2,   [1024, True]]              # 28  P5/32 output

  # ── Detect from all 4 scales ───────────────────────────────────────────────
  - [[19, 22, 25, 28], 1, Detect, [nc]]               # P2 / P3 / P4 / P5
